'''
השילוב בין משתנים לבין input

הרי מה זה input ?
זה הדרך שלנו לקלוט מידע מהמשתמש

ומה זה משתנים ?
זה הדרך שלנו לאחסן את המידע שאנחנו מקבלים או מהמשתמש או מאיתנו


בפקודה input כאשר אנחנו לא מציינים את סוג המשתנה
כל מה שנכניס ל-input יהיה טקסט וזה לא משנה מה נכניס.
גם אם זה יהיה מספרים שלמים, או עשרוניים, או לא משנה מה. זה תמיד יהיה טקסט.

'''
name = input('Enter your name : ')
print(name)
print(type(name))

'''
כאשר יש לנו מקרה שבו נרצה להכריח את המשתמש להכניס לי מספר
אני אצטרך לבצע המרה
אני אצטרך לבצע המרה מטקסט למספר

אם יש לי משתנה בשם age בצורה הזו :

age = input("Enter your age")

ואני רוצה שהוא יהיה מספר שלם

age = int(input("Enter your age"))
'''
age = float(input('Enter your age : '))
print(age)
print(type(age))
