'''
משתנים

משתנים בתכנות זה הדרך שלנו כמתכנתים לאחסן מידע
אם זה מידע מהמשתמש
או מידע שאנחנו יוצרים

יש לנו כרגע 3 סוגים של משתנים:

1. int - integer - מספרים שלמים
2. float - מספר עשרוני
3. str - string - טקסט (צריך להיות מלווה במרכאות)

לכל משתנה יש 2 דברים

name = value
ערך = שם

'''

# int - מספר שלם
my_age = 25
print(my_age)

# משתנה עשרוני - float
avg = 98.7
print(avg)

# טקסט - str
name = 'Eran Levy'
print(name)

# ------------------------------

'''
פקודה חדשה שנקראת type
type באנגלית זה סוג

type מאפשרת לנו כמתכנתים לבדוק מה הסוג של המשתנה שיש לנו

למה אנחנו בכלל צריכים את הפקודה type

my_age = 29 - python

int my_age = 29 - Java

איך משתמשים בה ?

type(שם המשתנה)
'''

# דוגמא
print(type(my_age))
print(type(avg))
print(type(name))
